In [2]:
# file=open('<file_name>','<modes>')
# file.close()                                        # # file_name==>> file name
                                                      # # modes==>>create,read,write,append garna lai ho

In [4]:
# with open("<file_name>","mode")as file:
#     <operation>

In [5]:
# modes
# x=> "create"
# r=> "read"
# a=> "append"
# w=> "write"

In [ ]:
file=open("data.txt","x")
file.close()

In [4]:
# this is done for bug free  (or)
# exception create vayo vane yasto garne   (or)
# ferai fera hamile file lai same name bata create garna sakdainau so yasto gareko

try:
    file=open("data.txt","x")
    file.close()
except:
    print("the file is already exists")

the file is already exists

In [20]:
#exception wala example

a=input("enter a = ")
b=input("enter b = ")

try: 
    print(int(a)+int(b))
    
except Exception as e:
    print(e)
        
print("this is very important to print")

enter a = sa
enter b = 2
invalid literal for int() with base 10: 'sa'
this is very important to print

In [2]:
# read mode use gareko yasma
file=open("data.txt","r")
x=file.read()
print(x)
file.close()

1 Hello World
2 Hello World
3 Hello World
4 Hello World
5 Hello World
6 Hello World
7 Hello World
8 Hello World
9 Hello World
10 Hello World

In [3]:
print(type(x))

<class 'str'>

In [4]:
x

'1 Hello World\n2 Hello World\n3 Hello World\n4 Hello World\n5 Hello World\n6 Hello World\n7 Hello World\n8 Hello World\n9 Hello World\n10 Hello World'

In [13]:
x.split("\n")

['1 Hello World',
 '2 Hello World',
 '3 Hello World',
 '4 Hello World',
 '5 Hello World',
 '6 Hello World',
 '7 Hello World',
 '8 Hello World',
 '9 Hello World',
 '10 Hello World']

In [14]:
y=x.split('\n')
y[1]

'2 Hello World'

In [6]:
file=open("datas.txt","w")
file.write("Hello World I am sangit")
file.close()

In [13]:
file=open("data.txt","w")    # data override hunxa that means purano data delete vayara naya data file ma rakhdenxa
file.write(" #this sentence is printed.")
file.close()

In [14]:
# read mode use gareko yasma
file=open("data.txt","r")
x=file.read()
print(x)
file.close()

 #this sentence is printed.

In [37]:
# WAP to create a billing system using String.
# write mode use gareko yasma

Bill=""
NetValue=0
n=int(input("enter a number = "))
for i in range(n):
    name=input("enter name = ")
    quantity=int(input("enter quantity = "))
    price= int(input("enter price = "))
    Totalprice= quantity*price
    Bill=Bill + f"{name}----{quantity}----{price}----{Totalprice}"+"\n"
    NetValue=NetValue+Totalprice
    
print(Bill)

print(f"Toal NetValue is = {NetValue}\n" )

file=open("datas.txt","w")
file.write(Bill)
file.write(str(NetValue))            # write value always be string
file.close()

enter a number = 2
enter name = milk
enter quantity = 3
enter price = 50
enter name = bread
enter quantity = 3
enter price = 30
milk----3----50----150
bread----3----30----90

Toal NetValue is = 240

In [38]:
# WAP to create a billing system using String.
# append mode use gareko yasma

file=open("datas.txt","a") 
Bill=""
n=int(input("enter a number = "))
for i in range(n):
    name=input("enter name = ")
    quantity=int(input("enter quantity = "))
    price= int(input("enter price = "))
    Totalprice= quantity*price
    Bill= "\n"+f"{name}----{quantity}----{price}----{Totalprice}"
    file.write(Bill)
    

file.close()

enter a number = 2
enter name = mobile
enter quantity = 2
enter price = 50000
enter name = laptop
enter quantity = 1
enter price = 100000

In [40]:
# WAP to create a billing system using String.
# append mode use gareko yasma

file=open("datas.txt","a") 
Bill=""
n=int(input("enter a number = "))
for i in range(n):
    name=input("enter name = ")
    quantity=int(input("enter quantity = "))
    price= int(input("enter price = "))
    Totalprice= quantity*price
    Bill= "\n"+Bill + f"{name}----{quantity}----{price}----{Totalprice}"+"\n"
file.write(Bill)
print(Bill)   

file.close()

enter a number = 2
enter name = apple
enter quantity = 2
enter price = 60
enter name = banana
enter quantity = 2
enter price = 100


apple----2----60----120
banana----2----100----200

In [41]:
# WAP to create a billing system using String.
# append mode use gareko yasma

Bill=""
n=int(input("enter a number = "))
for i in range(n):
    name=input("enter name = ")
    quantity=int(input("enter quantity = "))
    price= int(input("enter price = "))
    Totalprice= quantity*price
    Bill= "\n"+Bill + f"{name}----{quantity}----{price}----{Totalprice}"+"\n"

print(Bill) 

file=open("datas.txt","a") 
file.write(Bill)
file.close()

enter a number = 2
enter name = copy
enter quantity = 2
enter price = 50
enter name = book
enter quantity = 2
enter price = 1000


copy----2----50----100
book----2----1000----2000

In [33]:
# WAP to create a billing system using String.

Bill=""
n=int(input("enter a number = "))
for i in range(n):
    name=input("enter name = ")
    quantity=int(input("enter quantity = "))
    price= int(input("enter price = "))
    Totalprice= quantity*price
    Bill=Bill + f"{name},{quantity},{price},{Totalprice}"+"\n"

print(Bill)

file=open("datas.csv","w")
file.write(Bill)
file.close()

enter a number = 2
enter name = coke
enter quantity = 2
enter price = 100
enter name = water
enter quantity = 2
enter price = 50
coke,2,100,200
water,2,50,100

In [32]:
# WAP to create a billing system using String.

Bill=""

file=open("datas.txt","w") 
n=int(input("enter a number = "))
for i in range(n):
    name=input("enter name = ")
    quantity=int(input("enter quantity = "))
    price= int(input("enter price = "))
    Totalprice= quantity*price
    Bill=Bill + f"{name},{quantity},{price},{Totalprice}"+"\n"

print(Bill)

file=open("datanext.csv","w")
file.write("Name,Quantity,Price,Total\n")
file.write(Bill)
file.close()

enter a number = 3
enter name = coke
enter quantity = 3
enter price = 100
enter name = momo
enter quantity = 3
enter price = 160
enter name = water
enter quantity = 2
enter price = 50
coke,3,100,300
momo,3,160,480
water,2,50,100

In [4]:
# pandas is used for data analyst

import pandas as pd
Dict={
    "name":["sangit","rohan","tiger","sonu"],
    "age":[22,12,34,25],
    "subject":["python","html","css",".net"]
}
df=pd.DataFrame(Dict)                             # DataFrame is an excel sheet presented inside python.

In [7]:
df

     name  age subject
0  sangit   22  python
1   rohan   12    html
2   tiger   34     css
3    sonu   25    .net

In [8]:
df.to_csv("datanext2.csv")

In [9]:
df.to_csv("datanext2_remove_index.csv",index=False)

In [10]:
df.head(2)

     name  age subject
0  sangit   22  python
1   rohan   12    html

In [11]:
df.tail(2)

    name  age subject
2  tiger   34     css
3   sonu   25    .net

In [12]:
df.describe()

             age
count   4.000000
mean   23.250000
std     9.069179
min    12.000000
25%    19.500000
50%    23.500000
75%    27.250000
max    34.000000

In [13]:
harry=pd.read_csv('datanext.csv')

In [14]:
harry

    Name  Quantity  Price  Total
0   coke         3    100    300
1   momo         3    160    480
2  water         2     50    100

In [15]:
harry['Price']

0    100
1    160
2     50
Name: Price, dtype: int64

In [16]:
harry["Price"][0]

100

In [17]:
harry["Price"][0]=50

C:\Users\Dell\AppData\Local\Temp/ipykernel_9652/3437316585.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry["Price"][0]=50

In [18]:
harry

    Name  Quantity  Price  Total
0   coke         3     50    300
1   momo         3    160    480
2  water         2     50    100

In [21]:
harry.to_csv("datanext.csv")

In [25]:
harry.index=['first' , 'second' , 'third']

In [26]:
harry

         Name  Quantity  Price  Total
first    coke         3     50    300
second   momo         3    160    480
third   water         2     50    100